geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

ids = {'user1': [213, 213, 213, 15, 213],
       'user2': [54, 54, 119, 119, 119],
       'user3': [213, 98, 98, 35]}

queries = [
    'смотреть сериалы онлайн',
    'новости спорта',
    'афиша кино',
    'курс доллара',
    'сериалы этим летом',
    'курс по питону',
    'сериалы про спорт',
    'смотреть сериалы бесплатно без регистрации и смс'
    ]

# эталоны

russia = [
    {'visit1': ['Москва', 'Россия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
    ]

france = [
    {'visit5': ['Париж', 'Франция']},
    ]

india = [
    {'visit2': ['Дели', 'Индия']},
    ]


func_3_res = {
    'длина в 2 слова': '38 %',
    'длина в 3 слова': '50 %',
    'длина в 7 слова': '12 %'
}

# фикстуры

func_1_fixture = [
    (geo_logs, 'Россия', russia),
    (geo_logs, 'франция', france),
    (geo_logs, 'индиЯ', india)
]
