# Дан список с визитами по городам и странам. Напишите код,
# который возвращает отфильтрованный список geo_logs, содержащий только визиты из России."

from function import find_country, kill_doubles, make_range
from pprint import pprint

geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

ids = {'user1': [213, 213, 213, 15, 213],
       'user2': [54, 54, 119, 119, 119],
       'user3': [213, 98, 98, 35]}

queries = [
    'смотреть сериалы онлайн',
    'новости спорта',
    'афиша кино',
    'курс доллара',
    'сериалы этим летом',
    'курс по питону',
    'сериалы про спорт',
    'смотреть сериалы бесплатно без регистрации и смс'
    ]

if __name__ == '__main__':
    func_1 = find_country(some_list=geo_logs, country='Россия')
    # pprint(func_1)

    func_2 = kill_doubles(some_dict=ids)
    # print(func_2)

    func_3 = make_range(some_list=queries)
    # pprint(func_3)

